docs/posts/2024-01-22-fdm-for-routing-mail.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-22 Mon 13:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Use ~fdm~ to make your emacs-org-mode email workflow smoother</title>
<meta name="author" content="Britt Anderson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="preamble" class="status">
<nav>
&emsp; <a href="/index.html">Home</a>
&emsp; <a href="/about.html">About</a>
&emsp; <a href="/pubs.html">Publications</a>
&emsp; <a href="/posts.html">Posts</a>
&emsp; <a href="/posts/theindex.html">Posts by Topics</a>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">Use <code>fdm</code> to make your emacs-org-mode email workflow smoother</h1>
<div id="outline-container-orgf677857" class="outline-2">
<h2 id="orgf677857"><span class="section-number-2">1.</span> FDM: a tool to make an emacs email workflow smoother</h2>
<div class="outline-text-2" id="text-1">
<p>
If you are one of the intermediate Emacs users who has cobbled together your own email pipeline you might find <a href="https://github.com/nicm/fdm"><code>fdm</code></a> a convenient addition to the workflow.
</p>

<p>
For a long time I had used <code>gnus</code> and I loved it, but lately things had gotten tricky when my university forced us all to use their microsoft exchange accounts and a more restrictive authorization process. Instead of just using <code>gnus</code> imap capacities to directly get my mail I had to put a new tool in between: <a href="https://davmail.sourceforge.net/"><code>davmail</code></a>. Then I was back to using a <code>dovecot</code> locally to serve up the mail to <code>gnus</code> (although this probably was not necessary). All these changes provoked me to rethink my use case a bit: as much as I liked <code>gnus</code> the audience for it seems to be decreasing as the graying neckbeard population thins out. If I wanted to old on to my old school email tools a little longer maybe I should retreat to the one with the largest population of users; that seemed to be the <code>mutt/neomutt</code> family. But still I sometimes wanted the comfort and familiarity of <code>emacs</code> and the currently most popular package there is undoubtedly <code>mu4e</code>. But both <code>mutt</code> and <code>mu4e</code> where missing something I really liked in <code>gnus</code>: fancy (or even vanilla) splitting of incoming emails. You take your incoming email and direct it to a folder based on criteria you set. Maybe just a from or to field. Or maybe a very complicated hierarchy of headers, dates, and subject lines. Then, when you open gnus and you decide to create an <code>org</code> event or todo while reading the email your link will work, because you have no need to refile the email. If you just let everything dump into an inbox that you manually redirect then you either have to remember to create the link after moving it, or you create the link before moving the email and later on the link is incorrect and you end up searching by subject line or something. This is where <a href="https://github.com/nicm/fdm"><code>fdm</code></a> fits in. It can essentially function as the "splitter" for you.
</p>

<p>
You might have a bit of trouble finding documentation on it, but the manual is included when you clone or download. In my case there is an Archlinux <a href="https://wiki.archlinux.org/title/Fdm">package.</a> The basic splitting use can be straightforward for a pipeline like mine.
</p>

<p>
I use <code>mbsync</code> to gather my mail from there different email providers and deposit that in three different <code>Inboxes</code> that live in a hierarchy that looks a bit like: <i>home/britt</i>.local/share/mail/&lt;acct1&gt;/&lt;usernameforthisacct&gt;/&#x2026; for each of the accounts. Then three is an <code>fdm.conf</code> file that in my case looks like:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>Pseudo Version of an FDM conf file</label><pre class="src src-sh">$<span style="font-weight: bold; font-style: italic;">genpath</span> = <span style="font-style: italic;">"/home/britt/.local/share/mail"</span>
$<span style="font-weight: bold; font-style: italic;">a1path</span> = <span style="font-style: italic;">"${genpath}/acct1/brittanderson/"</span>
...
account <span style="font-style: italic;">"acct1"</span> maildir <span style="font-style: italic;">"${a1path}Inbox"</span>
...
action <span style="font-style: italic;">"a1-2arch"</span> maildir <span style="font-style: italic;">"${a1path}Folders/arch2024"</span>

action <span style="font-style: italic;">"harddelete"</span> pipe <span style="font-style: italic;">"cat &gt; /dev/null"</span>


match <span style="font-style: italic;">"^From:.*spammy.com"</span><span style="font-weight: bold;"> in</span> headers action <span style="font-style: italic;">"harddelete"</span>
... 
match <span style="font-style: italic;">"^To:.*britt.*@acct1.*"</span><span style="font-weight: bold;"> in</span> headers and account <span style="font-style: italic;">"acct1"</span>  action <span style="font-style: italic;">"a1-2arch"</span>
...
</pre>
</div>

<p>
Then to get new mail I just invoke <code>(mbsync --all || mbsync --all) &amp;&amp; fdm fetch</code>.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> Now when I open either <code>mutt</code> or <code>mu4e</code> my mail is already in the email box (folder/directory) that I want it to remain. So, when I read the new message I can simply act on it when the notion is fresh, and the org links will just work (of course for mutt you have to set up an <code>org-protocol</code>; that is a discussion for another time [mostly because I am still working on it]). 
</p>

<p>
Hope this helps someone like me trying to do things that far exceed their time, need or ability. 
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Occassionally I was getting a fetch error when running <code>mbsync</code> that would always clear up on a second run. That "or" bit only runs the second <code>mbsync</code> command if the first returns 0. It just saved me having to manually repeat every once in awhile. Though for the last few months the fetch errors are gone.  
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: 2024-01-22 Mon 00:00</p>
<p class="author">Author: Britt Anderson</p>
<p class="date">Created: 2024-01-22 Mon 13:06</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
